[
    [
        {
            "speaker": "narrator",
            "dialog": "Sitting down you decide to rest your eyes for a second and recount what has led up to this moment.",
            "newSpeaker": "true"
        },
        {
            "speaker":"narrator",
            "dialog": "First off, what is your name? "
        },
        {
            "speaker": "narrator",
            "dialog": "You are a new student at the esteemed Royal Academy, with today being the first day at the school year. Aside from the hectic move in day your time at the school has been largely uneventful."
        },
        {
            "speaker": "narrator",
            "dialog": "Until..."
        },
        {
            "speaker": "claire",
            "dialog": "Open your eyes at once! That is not funny at all!"
        },
        {
            "speaker": "claire",
            "dialog": "Excuse me! Are you listening?"
        },
        {
            "speaker": "claire",
            "dialog": "A mere commoner has the nerve to share a desk with me? Know your place!",
            "newSpeaker": "true"
        },
        {
            "speaker": "narrator",
            "dialog": "Claire François, your apparent seat neighbor. Noble Daughter to the François house."
        },
        {
            "speaker": "claire",
            "dialog": "I will not stand for this. I order you to move at once!"
        },
        {
            "speaker": "narrator",
            "dialog": "Even if you wanted to, the seats are assigned. Both for organization and so student won't try to sit next to each other to disrupt the class."
        },
        {
            "speaker": "claire",
            "dialog": "Well?"
        },
        {
            "speaker": "claire",
            "dialog": "At least you know your place. However I refuse to share with a simple commoner for more than a day. By tommorrow you will be transferred. "
        },
        {
            "speaker": "claire",
            "dialog": "ExCUSE ME? How dare a commoner order ME around?"
        },
        {
            "speaker": "claire",
            "dialog": "This is unacceptable, I will not share a desk with a commoner. "
        },
        {
            "speaker": "narrator",
            "dialog": "Before Claire can say anything else the strike of the clock signals the start of class. Claire begrudgingly takes her seat.",
            "newSpeaker": "true"
        },
        {
            "speaker": "narrator",
            "dialog": "Sitting next to a commoner is far more dignified than causing a ruckus on the first day. "
        },
        {
            "speaker": "teacher",
            "dialog": "Good morning class! I am pleased to welcome on your first official day here at the Royal Academy!"
        },
        {
            "speaker": "teacher",
            "dialog": "My name is Professor Magic I will be your homeroom teacher for this year. First I will go over how your daily schedules will work."
        },
        {
            "speaker": "teacher",
            "dialog": "You will have 2 classes everyday separated by a break in between in the Afternoon, save for any special events we may have that day."
        },
        {
            "speaker": "teacher",
            "dialog": "Aside from those two classes you will have your Mornings before class and Evenings after class free. "
        },
        {
            "speaker": "teacher",
            "dialog": "Curfew is 10pm on Weekdays and 12am on Weekends so please be back in your dorms by that time."
        },
        {
            "speaker": "teacher",
            "dialog": "For this week we will be gauging you all on your knowledge culminating into an exam on Day 1 of next week. "
        },
        {
            "speaker": "teacher",
            "dialog": "With that, let us start class."
        }
    ]
]
